etp-backend/src/main/resources/asha/case-create.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageHeader xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:messageVersion>1.0</ns0:messageVersion>
            <ns0:requestId>{{request-id}}</ns0:requestId>
            <ns0:senderId>{{sender-id}}</ns0:senderId>
        </ns0:MessageHeader>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:createECase xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:createCaseOperation>
                <ns0:classification>
                    <ns0:code>{{classification}}</ns0:code>
                </ns0:classification>
                <ns0:service>{{service}}</ns0:service>
                <ns0:name>{{name}}</ns0:name>
                <ns0:description>{{description}}</ns0:description>
                {{#attach}}
                <ns0:AttachOperation>
                    {{#contact}}
                    <ns0:Contact>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:emailAddress>{{email-address}}</ns0:emailAddress>
                        <ns0:firstName>{{first-name}}</ns0:firstName>
                        <ns0:lastName>{{last-name}}</ns0:lastName>
                        <ns0:phoneNumber>{{phone-number}}</ns0:phoneNumber>
                        <ns0:organizationalUnitName>{{organizational-name}}</ns0:organizationalUnitName>
                    </ns0:Contact>
                    {{/contact}}
                </ns0:AttachOperation>
                {{/attach}}
            </ns0:createCaseOperation>
        </ns0:createECase>
    </soap-env:Body>
</soap-env:Envelope>
